-- 切换到school数据库
use school;

-- 插入学院数据
insert into tb_college (collname, collmaster)
values ('计算机学院', '左冷禅'),
       ('外国语学院', '岳不群'),
       ('经济管理学院', '风清扬');

-- 插入学生数据
insert into tb_student (stuid, stuname, stusex, stubirth, stuaddr, collid)
values (1001, '杨逍', 1, '1990-3-4', '四川成都', 1),
       (1002, '任我行', 1, '1992-2-2', '湖南长沙', 1),
       (1033, '王语嫣', 0, '1989-12-3', '四川成都', 1),
       (1572, '岳不群', 1, '1993-7-19', '陕西咸阳', 1),
       (1378, '纪嫣然', 0, '1995-8-12', '四川绵阳', 1),
       (1954, '林平之', 1, '1994-9-20', '福建莆田', 1),
       (2035, '东方不败', 1, '1988-6-30', null, 2),
       (3011, '林震南', 1, '1985-12-12', '福建莆田', 3),
       (3755, '项少龙', 1, '1993-1-25', null, 3),
       (3923, '杨不悔', 0, '1985-4-17', '四川成都', 3),
       (4040, '隔壁老王', 1, '1989-1-1', '四川成都', 2);

-- 删除学生数据
delete
from tb_student
where stuid = 4040;

-- 更新学生数据
update tb_student
set stuname='杨过',
    stuaddr='湖南长沙'
where stuid = 1001;

-- 插入老师数据
insert into tb_teacher (teaid, teaname, teatitle, collid)
values (1122, '张三丰', '教授', 1),
       (1133, '宋远桥', '副教授', 1),
       (1144, '杨逍', '副教授', 1),
       (2255, '范遥', '副教授', 2),
       (3366, '韦一笑', '讲师', 3);

-- 插入课程数据
insert into tb_course (couid, couname, coucredit, teaid)
values (1111, 'Python程序设计', 3, 1122),
       (2222, 'Web前端开发', 2, 1122),
       (3333, '操作系统', 4, 1122),
       (4444, '计算机网络', 2, 1133),
       (5555, '编译原理', 4, 1144),
       (6666, '算法和数据结构', 3, 1144),
       (7777, '经贸法语', 3, 2255),
       (8888, '成本会计', 2, 3366),
       (9999, '审计学', 3, 3366);

-- 插入选课数据
insert into tb_record (sid, cid, seldate, score)
values (1001, 1111, '2017-09-01', 95),
       (1001, 2222, '2017-09-01', 87.5),
       (1001, 3333, '2017-09-01', 100),
       (1001, 4444, '2018-09-03', null),
       (1001, 6666, '2017-09-02', 100),
       (1002, 1111, '2017-09-03', 65),
       (1002, 5555, '2017-09-01', 42),
       (1033, 1111, '2017-09-03', 92.5),
       (1033, 4444, '2017-09-01', 78),
       (1033, 5555, '2017-09-01', 82.5),
       (1572, 1111, '2017-09-02', 78),
       (1378, 1111, '2017-09-05', 82),
       (1378, 7777, '2017-09-02', 65.5),
       (2035, 7777, '2018-09-03', 88),
       (2035, 9999, default, null),
       (3755, 1111, default, null),
       (3755, 8888, default, null),
       (3755, 9999, '2017-09-01', 92);